import Header from "@/layout/headers/header";
import Wrapper from "@/layout/wrapper";
// import { promises as fs } from "fs";
// import BlogArea from '@/components/blogs/blog-area';//
import Footer from "@/layout/footers/footer";
import { Suspense } from "react";
import Loading from "./loading";

export default async function ReturnsAndRefundsPage() {
  // const file = await fs.readFile(
  //   process.cwd() + "/src/app/product-data.json",
  //   "utf8"
  // );

  return (
    <Wrapper>
      {/* <Loading /> */}
      {/* header start */}

      <Header />

      {/* header end */}

      <main>
        <Suspense fallback={<Loading />}>
          <section className="product__area pt-30 pb-100">
            <div className="container">
              <p
                className="text-black"
                dangerouslySetInnerHTML={{
                  __html: `রিটার্ন এবং রিফান্ড পলিসি: <br/><br/>

রিটার্ন পলিসি- <br/><br/>

প্রোডাক্ট গ্রহণের পর প্রোডাক্টের সমস্যার (যেমন : প্রোডাক্ট ভাঙ্গা, ছেঁড়া, ভুল সাইজ, প্রোডাক্ট কাজ না করা, ছবির সাথে প্রোডাক্টের মিল না থাকা ইত্যাদি) ক্ষেত্রে আপনি ক্রয়-কৃত ৭ দিনের মধ্যে ফেরত দিতে পারবেন। আপনার যদি কোন পণ্য ফেরত দিতে হয় তাহলে অর্ডার নম্বর এবং ফেরত দেওয়ার বিস্তারিত কারনসহ আমাদের সাথে যোগাযোগ করতে পারেন। আমরা যতদ্রুত সম্ভব ফেরত প্রদানের জন্য করনীয় বিষয় সম্পর্কে আপনাকে অবহিত করবো।  <br/><br/>

রিটার্ন করার জন্য যে কারন গুলো বিবেচনা করা হবে- <br/><br/>

প্রদান-কৃত পণ্যটি নষ্ট। <br/><br/>

পরিমাণে যদি কম থাকে। <br/><br/>

প্রদান-কৃত পণ্যটির সাইজ যদি ভুল হয়। <br/><br/>

অথবা ভুল পণ্য যদি পাঠানো হয়ে থাকে।<br/><br/>

ওয়েবসাইটে দেওয়া ছবির সাথে যদি প্রদান-কৃত পণ্য না মিলে (বি দ্রঃ আপনার ডিভাইসের রেজুলেশনের কারনে ছবির কিছুটা তারতম্য হতে পারে। ) <br/><br/>

বি দ্রঃ  যেকোনো ভুলভ্রান্তি এবং দেরি এড়াতে, পার্সেলটি রিটার্ন এজেন্ট/ পিক আপ স্টেশনে দেওয়ার সময় পার্সেলের উপর অর্ডার নম্বর এবং রিটার্ন ট্র্যাকিং নম্বর দেওয়ার অনুরোধ রইলো। <br/><br/>

উপরের শর্ত সঠিকভাবে পূরণ না হলে আমরা রিটার্ন রিকোয়েস্ট বাদ দিতে যাবতীয় পদক্ষেপ নিবো। <br/><br/>

আপনার রিটার্ন রিকোয়েস্ট যদি প্রত্যাখ্যান করা হয় তাহলে ৭ থেকে ১০ কর্ম দিবসের মধ্যে পণ্যগুলো ফেরত পাঠানো হবে। ৩ বার চেষ্টার পর যদি পণ্য বুঝিয়ে দেওয়া সম্ভব না হয় তাহলে এই পণ্য বিষয়ে কর্তৃপক্ষ দায়ী থাকবে না এবং কোন ধরণের রিফান্ড ও দেওয়া হবে না।  <br/><br/>

রিফান্ড পলিসি- <br/><br/>

প্রোডাক্টটি রিটার্ন এজেন্টকে দেওয়ার পর থেকে ৭ থেকে ১০ দিনের মধ্যে আপনার রিফান্ড করা হবে তবে আশা করা যায় আরও দ্রুত রিফান্ড পাবেন। রিটার্ন এবং রিফান্ড পলিসি: <br/><br/>

রিটার্ন পলিসি- <br/><br/>

প্রোডাক্ট গ্রহণের পর প্রোডাক্টের সমস্যার (যেমন : প্রোডাক্ট ভাঙ্গা, ছেঁড়া, ভুল সাইজ, প্রোডাক্ট কাজ না করা, ছবির সাথে প্রোডাক্টের মিল না থাকা ইত্যাদি) ক্ষেত্রে আপনি ক্রয়-কৃত ৭ দিনের মধ্যে ফেরত দিতে পারবেন। আপনার যদি কোন পণ্য ফেরত দিতে হয় তাহলে অর্ডার নম্বর এবং ফেরত দেওয়ার বিস্তারিত কারনসহ আমাদের সাথে যোগাযোগ করতে পারেন। আমরা যতদ্রুত সম্ভব ফেরত প্রদানের জন্য করনীয় বিষয় সম্পর্কে আপনাকে অবহিত করবো।  <br/><br/>

রিটার্ন করার জন্য যে কারন গুলো বিবেচনা করা হবে- <br/><br/>

প্রদান-কৃত পণ্যটি নষ্ট। <br/><br/>

পরিমাণে যদি কম থাকে। <br/><br/>

প্রদান-কৃত পণ্যটির সাইজ যদি ভুল হয়। <br/><br/>

অথবা ভুল পণ্য যদি পাঠানো হয়ে থাকে।<br/><br/>

ওয়েবসাইটে দেওয়া ছবির সাথে যদি প্রদান-কৃত পণ্য না মিলে (বি দ্রঃ আপনার ডিভাইসের রেজুলেশনের কারনে ছবির কিছুটা তারতম্য হতে পারে। ) <br/><br/>

বি দ্রঃ  যেকোনো ভুলভ্রান্তি এবং দেরি এড়াতে, পার্সেলটি রিটার্ন এজেন্ট/ পিক আপ স্টেশনে দেওয়ার সময় পার্সেলের উপর অর্ডার নম্বর এবং রিটার্ন ট্র্যাকিং নম্বর দেওয়ার অনুরোধ রইলো। <br/><br/>

উপরের শর্ত সঠিকভাবে পূরণ না হলে আমরা রিটার্ন রিকোয়েস্ট বাদ দিতে যাবতীয় পদক্ষেপ নিবো। <br/><br/>

আপনার রিটার্ন রিকোয়েস্ট যদি প্রত্যাখ্যান করা হয় তাহলে ৭ থেকে ১০ কর্ম দিবসের মধ্যে পণ্যগুলো ফেরত পাঠানো হবে। ৩ বার চেষ্টার পর যদি পণ্য বুঝিয়ে দেওয়া সম্ভব না হয় তাহলে এই পণ্য বিষয়ে কর্তৃপক্ষ দায়ী থাকবে না এবং কোন ধরণের রিফান্ড ও দেওয়া হবে না।  <br/><br/>

রিফান্ড পলিসি- <br/><br/>

প্রোডাক্টটি রিটার্ন এজেন্টকে দেওয়ার পর থেকে ৭ থেকে ১০ দিনের মধ্যে আপনার রিফান্ড করা হবে তবে আশা করা যায় আরও দ্রুত রিফান্ড পাবেন।`,
                }}
              />
            </div>
          </section>
        </Suspense>
      </main>

      {/* footer start */}
      <Footer />
      {/* footer end */}
    </Wrapper>
  );
}
