import Header from "@/layout/headers/header";
import Wrapper from "@/layout/wrapper";
// import { promises as fs } from "fs";
// import BlogArea from '@/components/blogs/blog-area';//
import Footer from "@/layout/footers/footer";
import { Suspense } from "react";
import Loading from "./loading";

export default async function PrivayPolicyPage() {
  // const file = await fs.readFile(
  //   process.cwd() + "/src/app/product-data.json",
  //   "utf8"
  // );

  return (
    <Wrapper>
      {/* <Loading /> */}
    <div className="header-section ">

    {/* header start */}
          <Header />
          {/* header end */}
        </div>

        <br></br>
        <br></br>
      
      <main>
        <Suspense fallback={<Loading />}>
          <section className="product__area pt-30 pb-100">
            <div className="container">
              <p
                className="text-black"
                dangerouslySetInnerHTML={{
                  __html: `প্রাইভেসি পলিসি-<br/><br/>

আপনার গোপনীয়তা রক্ষা করা এবং আপনার ডেটার নিরাপত্তা আমাদের জন্য সবচেয়ে গুরুত্বপূর্ণ। আমরা শুধুমাত্র সার্ভিস প্রদান উন্নত করা , সেবা সম্পর্কে জানানো এবং মার্কেটিং বিষয়ক কাজের জন্য ডেটা সংগ্রহ করে থাকি। যদি এই ধরণের কাজের জন্য আপনার তথ্য কাজে না আসে তাহলে আমরা সেই তথ্য মুছে ফেলি বা ফেলা হবে। <br/><br/>

ডেটা সংগ্রহ প্রসঙ্গে- <br/>

ক্রয় পরবর্তী সেবা প্রদানের জন্য এবং সেবার মান উন্নত করতে যে সকল ডেটা সংগ্রহ করা হয়- <br/>

আপনার নাম, প্রোফাইলের ছবি এবং জন্ম তারিখ।<br/>

ফোন নম্বর, ইমেইল এড্রেস, বিল পাঠানোর ঠিকানা এবং পণ্য সরবারহের ঠিকানা। <br/>

পেমেন্ট ইনফরমেশন, ডেবিট/ ক্রেডিট কার্ড ইনফরমেশন এবং ব্যাংকের ইনফরমেশন। <br/>

সাইট ব্যবহারকারীর ভিজিটের তথ্য, ক্লিক, ডিভাইস , অপারেটিং সিস্টেম এর তথ্য। <br/>

লগইন ডাটা, ব্রাউজার টাইপ, ভার্সন<br/>

ইউজার নেম, পাসওয়ার্ড, পছন্দ, অপছন্দ, ফিডব্যাক, অর্ডারের তথ্য।   <br/>

লোকেশন, আইডি কার্ড এর ইনফরমেশন। <br/>

আমরা নিম্নোক্তভাবে আপনার তথ্য ব্যবহার করে থাকবো- <br/>

পণ্য আপনাকে পৌঁছে দিতে। <br/>

আপনার পছন্দের পণ্য আপনার সামনে উপস্থাপন করতে। <br/>

আমাদের পরিসেবা আপনাকে জানাতে। <br/>

পেমেন্ট তথ্য সঠিক কিনা তা যাচাই করতে। <br/>

আপনার পছন্দ অপছন্দ বুঝতে। <br/>

ইউজার এক্সপেরিয়েন্স বোঝার জন্য- <br/>

strike.com সাইটে ইউজার এক্সপেরিয়েন্স কেমন তা বোঝার জন্য বিভিন্ন ধরণের সার্ভে এবং রিসার্চ করা হয়। ইউজারের ডেমোগ্রাফিকস, ইন্টারেস্ট, বিহেভিয়ার ট্রাক করা হয় যেন ইউজারকে আরও সুন্দর অভিজ্ঞতা দেওয়া সম্ভব হয়। আমরা আপনার তথ্য অ্যাডমিনিস্ট্রেশন, মতামত, মার্কেট রিসার্চ এবং কম্পিটিশন এনালাইসিস এর কাজে ব্যবহার করতে পারি। <br/>

কুকি- <br/>

আমাদের সাইট অথরাইজ কুকিজ বা একই ধরণের সার্ভিস ব্যবহার করে থাকে। আমাদের সাইট ব্যবহার করার জন্য কুকিজ ব্যবহার বাধ্যতামূলক নয়। কুকিজ হল এক ধরণের টেক্সট ফাইল যা ব্রাউজারে সেভ থাকে। বিভিন্ন সময় সাইট ব্যবহারের সময় সাইট এই ইউজার কে চিনতে পারে এবং তার পছন্দ মত পণ্য দেখাতে পারে। আপনি যদি কুকিজ সম্পর্কে আরও জানতে চান তাহলে গুগলে সার্চ করতে পারেন। <br/>

 সিকুরিটি- <br/>

ডেটা সুরক্ষার জন্য রয়েছে যথাযথ টেকনিক্যাল এক্সপার্ট এবং সিকুরিটি সিস্টেম। আমরা আপনার ডেটা একটি সুরক্ষিত সার্ভারে সংরক্ষণ করি। আমাদের সার্ভারে কয়েকটি লেয়ারে ফায়ার ওয়াল রয়েছে। আমরা মাঝে মাঝে আপনার একাউন্ট ভ্যারিফাই করতে বলি যেন আপনার একাউন্ট আরও সুরক্ষিত থাকে। এখন আপনার পালা, আপনার একাউন্ট এবং আপনার নিজস্ব কম্পিউটার কে অন্যদের হাত থেকে সুরক্ষিত রাখা। <br/>

আপনার অধিকার সমূহ- <br/>

আমরা আপনার ডাটার বিষয়ে যথেষ্ট সচেতন। আপনি চাইলে আপনার ডাটা দেহতে পারবেন এবং আপনার ডাটা মুছে ফেলতে আমাদের জানাতে পারবেন। <br/>

ডাটা প্রটেকশন আইন অনুযায়ী আমরা আপনার ডাটা মুছে ফেলতে ফিস নিতে পারি। যদি তেমন হয় আপনাকে ফিস সম্পর্কে জানানো হবে।<br/> 

বি দ্রঃ <br/>

আমরা ১৮ বছরের নিচের বয়সীদের কাছে পণ্য বা সেবা বিক্রি করে থাকি না। এবং আমাদের জানামতে কোন ১৮ বছরের নিচের বয়সীদের তথ্য সংগ্রহ বা সংরক্ষণ করি না। আপনি আমাদের সাইট ব্যবহার করছেন তাই আমরা ধারণা করছি আপনার বয়স ১৮ বছর বা তার বেশি। `,
                }}
              />
            </div>
          </section>
        </Suspense>
      </main>

      {/* footer start */}
      <Footer />
      {/* footer end */}
    </Wrapper>
  );
}
