import Header from "@/layout/headers/header";
import Wrapper from "@/layout/wrapper";
// import { promises as fs } from "fs";
// import BlogArea from '@/components/blogs/blog-area';//
import Footer from "@/layout/footers/footer";
import { Suspense } from "react";
import Loading from "./loading";

export default async function TermsAndConditionsPage() {
  // const file = await fs.readFile(
  //   process.cwd() + "/src/app/product-data.json",
  //   "utf8"
  // );

  return (
    <Wrapper>
      {/* <Loading /> */}
      {/* header start */}

      <Header />

      {/* header end */}

      <main>
        <Suspense fallback={<Loading />}>
          <section className="product__area pt-30 pb-100">
            <div className="container">
              <p
                className="text-black"
                dangerouslySetInnerHTML={{
                  __html: `শর্তাবলী<br/><br/>

Strike এ আপনাকে স্বাগতম। Strike একটি মার্কেট-প্লেস। নিচের বক্তব্যটি আপনার অ্যাক্সেস, এবং ব্যবহার নিয়ন্ত্রণ সংক্রান্ত শর্তাবলী। আপনি সাইটটি ব্যবহার করছেন তাই আমরা ধরে নিচ্ছি, আপনি নিম্নোক্ত শর্তাবলী স্বীকার করেন এবং প্রতিনিধিত্ব করেন যে আপনি এই শর্তাবলী মেনে চলতে সম্মত হয়েছেন। আপনি যদি এই ইউজার এগ্রিমেন্টে সম্মত না হন তবে অনুগ্রহ করে এই সাইটে প্রবেশ, নিবন্ধন বা ব্যবহার করবেন না। এই সাইটটির মালিকানা, পরিচালনার যাবতীয় দায়িত্ব Strike ডট কমের।<br/><br/>

strike.com কোন পূর্ব বিজ্ঞপ্তি ছাড়াই যে কোন সময় এই শর্তাবলীর পরিবর্তন, পরিবর্তন, যোগ বা অংশগুলিকে অপসারণ করার অধিকার সংরক্ষণ করে। কোন প্রকার নোটিশ প্রদান না করে সাইটে পোস্ট করা হলেও পরিবর্তন কার্যকর হবে। যেকোনো আপডেটের জন্য অনুগ্রহ করে নিয়মিত এই নিয়ম ও শর্তাবলী দেখুন। আমাদের যাবতীয় সেবা পেতে এখানে একটি একাউন্ট তৈরি করুন এবং সঠিক সেবার মান পেতে সকল তথ্য প্রদান করুন। Strike যেকোনো সময় যেকোনো একাউন্ট বাতিল করার অধিকার সংরক্ষণ করে এবং তাতে যেকোনো সমস্যা সৃষ্ট হলে তার জন্য Strike দায়ী থাকবে না। <br/><br/>

আপনার ইউজার একাউন্ট ডিটেইলস , পাসওয়ার্ড গোপন রাখা আপনার দায়িত্ব। strike.com একাউন্ট খুলে আপনি যাবতীয় শর্তে একমত হয়েছেন যে, আপনার সকল তথ্য গোপন রাখবেন। যদি কখনো মনে হয় আপনার একাউন্ট কেউ ব্যবহার করছে কিংবা, মিস-ইউজ হচ্ছে তাহলে সাথে সাথে Strike কে জানাতে হবে। যদি না জানানো হয় এবং এর দ্বারা Strike এর কোন ক্ষতি সাধন হয় তাহলে আপনি যেই ক্ষতিপূরণ দিতে বাধ্য থাকবেন। <br/><br/>

এই সাইটে প্রকাশিত সকল ছবি বা লেখা তথ্য প্রদানের জন্য। এর সকল তথ্য সঠিক হওয়ার গ্যারান্টি Strike দিচ্ছে না। এখানে প্রকাশিত তথ্য সাপ্লায়ার এর ভুলের কারনে হতে পারে। তাই যাচাই-পূর্বক সকল পণ্য ক্রয় করতে অনুরোধ করা হচ্ছে। Strike সাইটে প্রকাশিত যেকোনো তথ্য বাণিজ্যিক ব্যবহার করতে হলে অবশ্যই Strike লিখিত অনুমতি নিতে হবে অন্যথায় আইনি ব্যবস্থা গ্রহণ করা হতে পারে। <br/><br/>

আমরা প্রতিটি পণ্যের স্টকের তথ্য আমাদের সাইটে প্রকাশ করে থাকি। কিন্তু এই তথ্য পর্যাপ্ত নয়। অনেক সময় আমাদের সাপ্লায়ারের কাছে পণ্য না থাকায় পণ্যটি দেওয়া সম্ভব নাও হতে পারে। যদি কোন পণ্য দেওয়া সম্ভব না হয় বা অর্ডারটি ক্যান্সেল করতে হয় তাহলে আপনাকে SMS বা EMAIL করে জানানো হবে। <br/><br/>

একটি অর্ডার বিভিন্ন কারনে ক্যান্সেল হতে পারে। শুধুমাত্র ইমেইল, ফোন নম্বর নয়, আরও তথ্য প্রদান করার জন্য বলা হতে পারে। ক্রেডিট বা ডেবিট কার্ডের বিষয়ক  যেকোনো প্রতারণা এড়াতে, আপনাকে পণ্য সরবরাহ করার আগে পেমেন্ট সিস্টেম এবং আপনার দেওয়া ব্যক্তিগত যাচাই করার অধিকার Strike সংরক্ষণ করে।  এই যাচাই করার জন্য আপনার পরিচয়, বাসস্থান, ব্যাংকিং ইনফরমেশন ব্যবহার হবে।  এই তথ্যগুলোর সম্মানজনক উত্তর না পাওয়া গেলে অর্ডার বাতিল করা হতে পারে। কোনরকম পূর্ব নোটিশ ছাড়াই প্রতারণা এড়াতে Strike অর্ডার ক্যান্সেল করার অধিকার সংরক্ষণ করে। `,
                }}
              />
            </div>
          </section>
        </Suspense>
      </main>

      {/* footer start */}
      <Footer />
      {/* footer end */}
    </Wrapper>
  );
}
